# Определить индексы элементов массива (списка), значения которых принадлежат заданному диапазону 
# (т.е. не меньше заданного минимума и не больше заданного максимума)
# x_min = 5, x_max = 15
# Входные данные: -5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7

input_list = [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
output_list = []
x_min = 5
x_max = 15

for i in range(len(input_list)):
    if input_list[i] > x_min and input_list[i] < x_max:
        output_list.append(i)
print(output_list)  
    
input('\nНажмите Enter для выхода\n')